---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.SpeckleColor2
source: html/f06382a9-603d-2a57-c200-ef8a4de777cc.htm
---
# Autodesk.Revit.DB.Visual.Speckle.SpeckleColor2 Property

The property labeled "Color 2" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string SpeckleColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.